<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>






<h2> Mapas conceituais livres de contexto </h2>






<p>Mapas conceituais livres de contexto s&atilde;o mapas
conceituais que n&atilde;o dependem de uma ontologia para serem
feitos. Servem para fazer apresenta&ccedil;&otilde;es, imagens,
artigos ou simples exerc&iacute;cio. N&atilde;o t&ecirc;m
nenhum compromisso com avalia&ccedil;&atilde;o, exceto se
pedido por algum professor.</p>






<p>&nbsp;</p>






<p>&nbsp;</p>






<p>&nbsp;</p>






<h3><a name="1"></a>Criando o mapa </h3>






<p>Ao abrir o CMEditor, aparecer&aacute; a caixa de
di&aacute;logo &ldquo;Bem-vindo ao CMEditor&rdquo;. Na
lista de sele&ccedil;&atilde;o, selecione a
op&ccedil;&atilde;o &ldquo;Desejo criar um mapa conceitual
livre de contexto&rdquo;, clicando OK em seguida. </p>






<p align="center"><img src="imagens/001.jpg" height="275" width="303"></p>






<p>Se quiser criar um mapa conceitual livre de contexto com o
CMEditor j&aacute; em execu&ccedil;&atilde;o,
voc&ecirc; pode seguir uma das 3 alternativas: </p>






<ul>






  <li>
    
    
    
    
    
    <p>Na barra de menus, clique em
&ldquo;Arquivo&rdquo;, e &ldquo;Novo&rdquo;, em
seguida; </p>






  </li>






  <li>
    
    
    
    
    
    <p>Na barra de tarefas, clique no bot&atilde;o <img src="imagens/002.gif" height="24" width="24">;
    </p>






  </li>






  <li>
    
    
    
    
    
    <p>No teclado, segure a tecla Ctrl e aperte N. </p>






  </li>






</ul>






<p>Se voc&ecirc; tiver feito alguma
modifica&ccedil;&atilde;o no mapa conceitual em
execu&ccedil;&atilde;o antes de voc&ecirc; fazer uma das
opera&ccedil;&otilde;es acima, surgir&aacute; o
di&aacute;logo de &ldquo;Salvar&rdquo;. Saiba mais detalhes
clicando <a href="salvar_abrir.html">aqui</a>. </p>






<p>Ap&oacute;s feita a opera&ccedil;&atilde;o de
&ldquo;Salvar&rdquo;, surgir&aacute; a caixa de
di&aacute;logo de &ldquo;Novo mapa conceitual&rdquo;. O
mesmo ocorrer&aacute; se voc&ecirc; n&atilde;o tiver feito
modifica&ccedil;&otilde;es no mapa conceitual aberto
anteriormente. Nessa caixa de di&aacute;logo, como descrito abaixo,
clique em &ldquo;Livre de contexto&rdquo;. </p>






<p align="center"><img src="imagens/003.jpg" height="127" width="317"></p>






<p>Obs.: se voc&ecirc; fechar essa caixa de
di&aacute;logo sem clicar em nenhum bot&atilde;o,
tamb&eacute;m ser&aacute; criado um mapa conceitual livre de
contexto. </p>






<p>&nbsp;</p>






<p>&nbsp;</p>






<p>&nbsp;</p>






<h3><a name="2"></a>Preenchendo o mapa </h3>






<p>A primeira coisa a fazer &eacute; criar um conceito. Para
isso, basta clicar duas vezes em um espa&ccedil;o em branco da
&aacute;rea de desenho. Surgir&aacute; o di&aacute;logo de
cria&ccedil;&atilde;o de elementos. </p>






<p align="center"><img src="imagens/004.jpg" height="175" width="268"></p>






<p>Nesta caixa de di&aacute;logo, note que
aparecer&atilde;o 3 tipos de elementos a serem criados: </p>






<ul>






  <li>
    
    
    
    
    
    <p><strong>Conceito simples: </strong>Nas proposi&ccedil;&otilde;es, podem receber e
enviar arcos. Possuem setas flutuantes, que s&atilde;o usadas para
criar as proposi&ccedil;&otilde;es. </p>






  </li>






  <li>
    
    
    
    
    
    <p><strong>Exemplos: </strong>Diferente dos conceitos, s&oacute; podem receber
arcos nas proposi&ccedil;&otilde;es. Portanto, n&atilde;o
possuem setas flutuantes. </p>






  </li>






  <li>
    
    
    
    
    
    <p><strong>Legendas: </strong>Servem apenas para
fazer anota&ccedil;&otilde;es no mapa conceitual, que
n&atilde;o fazem parte do mapa, mas que podem
explic&aacute;-lo. </p>






  </li>






</ul>






<p>Pelo explicado acima, &eacute; recomendado que
voc&ecirc; escolha primeiramente desenhar um conceito. Escolha o
tipo de elemento e clique em OK. </p>






<p>Agora voc&ecirc; ir&aacute; querer editar os elementos
de um mapa conceitual livre de contexto. Para isso, basta usar o mouse,
clicando duas vezes em cima do determinado elemento.</p>






<p>Ao clicar duas vezes em cima de um conceito, de um exemplo ou
de uma legenda, aparecer&aacute; uma caixa de di&aacute;logo
com uma &aacute;rea de texto como a abaixo.</p>






<p align="center"><img src="imagens/011.jpg" height="190" width="268"></p>






<p>Voc&ecirc; pode, ent&atilde;o, digitar o novo
r&oacute;tulo e clicar em OK.</p>






<p>Para criar relacionamentos, voc&ecirc; deve posicionar o
cursor do mouse sobre um conceito. Surgir&atilde;o duas setas
flutuantes. </p>






<p align="center"><img src="imagens/005.gif" height="31" width="83"></p>






<p>Cada uma corresponde a um tipo de processo cognitivo. O
&iacute;cone indica diferencia&ccedil;&atilde;o progressiva
e o &iacute;cone, reconcilia&ccedil;&atilde;o integrativa.
Saiba mais clicando aqui. </p>






<p>Posicione o mouse sobre uma das setas. Clique e segure o
bot&atilde;o do mouse. Arrastando a seta, voc&ecirc;
ver&aacute; uma linha surgir, para que lhe ajude a desenhar. </p>






<p align="center"><img src="imagens/006.gif" height="121" width="121"></p>






<p>Solte o bot&atilde;o no lugar desejado. Surgir&aacute;
o di&aacute;logo de cria&ccedil;&atilde;o de elementos, o
mesmo descrito anteriormente, com a exce&ccedil;&atilde;o de
que s&oacute; estar&atilde;o dispon&iacute;veis as
op&ccedil;&otilde;es de criar um conceito ou um exemplo. Nele,
se voc&ecirc; clicar em Cancelar, nenhum novo elemento
ser&aacute; criado. Se voc&ecirc; clicar em OK, ser&aacute;
criada uma proposi&ccedil;&atilde;o, composta de mais um
conceito/exemplo, uma frase de liga&ccedil;&atilde;o e arcos
ligando os elementos, como voc&ecirc; pode ver na figura abaixo.</p>






<p align="center"><img src="imagens/007.gif" height="239" width="90"></p>






<p>Se voc&ecirc; posicionar o cursor do mouse sobre uma frase
de liga&ccedil;&atilde;o, tamb&eacute;m
aparecer&aacute; uma seta flutuante. Por&eacute;m, apenas uma.
Ela &eacute; do mesmo tipo dos arcos ligados a essa frase.
Al&eacute;m disso, voc&ecirc; tamb&eacute;m deve editar o
r&oacute;tulo da frase de liga&ccedil;&atilde;o. Para isso,
proceda da mesma maneira usada para editar r&oacute;tulos de
conceitos, exemplos e legendas, ou seja, usando o mouse. </p>






<p align="center"><img src="imagens/009.gif" height="88" width="116"><img src="imagens/010.gif" height="112" width="100"></p>






<p>A partir de agora, voc&ecirc; pode ir criando seus mapas,
com duplos cliques e arraste de setas flutuantes, vindas de conceitos e
de frases de liga&ccedil;&atilde;o. Uma boa dica &eacute;
criar v&aacute;rios conceitos e, depois, fazer as
proposi&ccedil;&otilde;es.</p>






</body>
</html>
