<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  
  <title>Untitled Document</title>
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>


<body>





<h2> Mapas conceituais contextualizados </h2>





<p>Ao contr&aacute;rio dos mapas livres de contexto, os mapas
conceituais contextualizados dependem de uma ontologia para serem
feitos. </p>





<p>Uma ontologia &eacute; uma rela&ccedil;&atilde;o
de conceitos e rela&ccedil;&otilde;es, assim como os mapas
conceituais, s&oacute; que as rela&ccedil;&otilde;es
cont&ecirc;m v&aacute;rias frases de
liga&ccedil;&atilde;o. S&atilde;o usadas, no CMTool, pelos
professores, para que eles definam conceitos e frases de
liga&ccedil;&atilde;o e, a partir da&iacute;, as
proposi&ccedil;&otilde;es que eles acham mais corretas. Os
mapas conceituais que seus alunos far&atilde;o conter&atilde;o
os conceitos definidos. As proposi&ccedil;&otilde;es dos mapas
ser&atilde;o avaliadas comparando-as com as
rela&ccedil;&otilde;es contidas na ontologia, por meio de um
algoritmo gen&eacute;tico, o GAADT-CM, contido no CMTool. </p>





<p>Estes mapas, portanto, s&atilde;o o motivo de o CMTool
existir: a avalia&ccedil;&atilde;o. Aqui ser&atilde;o
descritos os passos para serem feitos mapas conceituais
contextualizados. </p>





<p>&nbsp;</p>





<p>&nbsp;</p>





<p>&nbsp;</p>





<h3><a name="1"></a>Criando o mapa </h3>





<p>Ao abrir o CMEditor, aparecer&aacute; a caixa de
di&aacute;logo &ldquo;Bem-vindo ao CMEditor&rdquo;. Na
lista de sele&ccedil;&atilde;o, selecione a
op&ccedil;&atilde;o &ldquo;Criar um mapa conceitual
contextualizado&rdquo;, clicando OK em seguida. </p>





<p align="center"><img src="imagens/013.jpg" height="274" width="301"></p>





<p>Se quiser criar um mapa conceitual livre de contexto com o
CMEditor j&aacute; em execu&ccedil;&atilde;o,
voc&ecirc; pode seguir uma das 3 alternativas: </p>





<ul>





  <li>
    
    
    
    
    <p>Na barra de menus, clique em
&ldquo;Arquivo&rdquo;, e &ldquo;Novo&rdquo;, em
seguida; </p>





  </li>





  <li>
    
    
    
    
    <p>Na barra de tarefas, clique no bot&atilde;o <img src="imagens/002.gif" height="24" width="24">;
    </p>





  </li>





  <li>
    
    
    
    
    <p>No teclado, segure a tecla Ctrl e aperte N. </p>





  </li>





</ul>





<p>Se voc&ecirc; tiver feito alguma
modifica&ccedil;&atilde;o no mapa conceitual em
execu&ccedil;&atilde;o antes de voc&ecirc; fazer uma das
opera&ccedil;&otilde;es acima, surgir&aacute; o
di&aacute;logo de &ldquo;Salvar&rdquo;. Saiba mais detalhes
clicando <a href="salvar_abrir.html">aqui</a>. </p>





<p>Ap&oacute;s feita a opera&ccedil;&atilde;o de
&ldquo;Salvar&rdquo;, surgir&aacute; a caixa de
di&aacute;logo de &ldquo;Novo mapa conceitual&rdquo;. O
mesmo ocorrer&aacute; se voc&ecirc; n&atilde;o tiver feito
modifica&ccedil;&otilde;es no mapa conceitual aberto
anteriormente. Nessa caixa de di&aacute;logo, como descrito abaixo,
clique em &ldquo;Contextualizado&rdquo;. </p>





<p align="center"><img src="imagens/014.jpg" height="127" width="317"></p>





<p>Ap&oacute;s escolher o tipo do mapa, surgir&aacute; a
caixa de di&aacute;logo de abertura de arquivo. Nela,
voc&ecirc; dever&aacute; procurar o local onde est&aacute;
salvo a ontologia que servir&aacute; como base para seu mapa
conceitual. Pe&ccedil;a a seu professor para que ele lhe oriente
nesse passo. </p>





<p align="center"><img src="imagens/018.jpg" height="356" width="509"></p>





<p>Basta selecionar a ontologia e clicar em OK. Ap&oacute;s
voc&ecirc; salvar seu mapa, voc&ecirc; n&atilde;o
precisar&aacute; chamar a ontologia outra vez. </p>





<p>&nbsp;</p>





<p>&nbsp;</p>





<p>&nbsp;</p>





<h3><a name="2"></a>Preenchendo o mapa </h3>





<p>A primeira coisa a fazer &eacute; criar um conceito. Para
isso, basta clicar duas vezes em um espa&ccedil;o em branco da
&aacute;rea de desenho. Surgir&aacute; o di&aacute;logo de
cria&ccedil;&atilde;o de conceitos. </p>





<p align="center"><img src="imagens/015.jpg" height="174" width="268"></p>





<p>Nesta caixa de di&aacute;logo, note que
aparecer&atilde;o 3 tipos de elementos a serem criados: </p>





<ul>





  <li>
    
    
    
    
    <p><strong>Conceito simples: </strong>Nas proposi&ccedil;&otilde;es, podem receber e
enviar arcos. Possuem setas flutuantes, que s&atilde;o usadas para
criar as proposi&ccedil;&otilde;es. Em mapas conceituais
contextualizados, eles s&atilde;o pr&eacute;-definidos na
ontologia de onde o mapa vem. </p>





  </li>





  <li>
    
    
    
    
    <p><strong>Exemplos: </strong>Diferente dos conceitos, s&oacute; podem receber
arcos nas proposi&ccedil;&otilde;es. Portanto, n&atilde;o
possuem setas flutuantes. </p>





  </li>





  <li>
    
    
    
    
    <p><strong>Legendas: </strong>Servem apenas para
fazer anota&ccedil;&otilde;es no mapa conceitual, que
n&atilde;o fazem parte do mapa, mas que podem
explic&aacute;-lo. </p>





  </li>





</ul>





<p>Para criar um conceito, voc&ecirc; dever&aacute;
proceder como na figura acima: selecionar o bot&atilde;o
&ldquo;Conceito&rdquo;. Ao lado do bot&atilde;o,
h&aacute; uma lista de conceitos que, como j&aacute; foi dito,
s&atilde;o vindos da ontologia. Selecione um e clique em OK.
Ap&oacute;s criar um conceito, seu nome n&atilde;o
surgir&aacute; mais na lista, s&oacute; quando voc&ecirc;
excluir o conceito da &aacute;rea de desenho. A medida que
voc&ecirc; for criando seus conceitos, acontecer&aacute; de
n&atilde;o sobrar mais nenhum, e voc&ecirc; n&atilde;o
poder&aacute; mais criar conceitos. Para voltar a poder criar
conceitos, exclua conceitos existentes na &aacute;rea de desenho.
Eles assim voltar&atilde;o para a lista. </p>





<p align="left">Para criar um exemplo ou uma legenda,
voc&ecirc; dever&aacute; selecionar o bot&atilde;o
&ldquo;Exemplo&rdquo; ou &ldquo;Legenda&rdquo; e clicar
em OK. Ao contr&aacute;rio dos conceitos voc&ecirc; pode criar
quantos exemplos e legendas quiser.</p>





<p>Agora voc&ecirc; ir&aacute; querer editar os elementos
de um mapa conceitual livre de contexto. Para isso, basta usar o mouse,
clicando duas vezes em cima do determinado elemento.</p>





<p>Como o conceito j&aacute; recebe o r&oacute;tulo ao
ser criado, n&atilde;o se faz t&atilde;o necess&aacute;rio
editar seu r&oacute;tulo. Mas, se voc&ecirc; quiser
troc&aacute;-lo, clique duas vezes em cima dele. Surgir&aacute;
o di&aacute;logo abaixo.</p>





<p align="center"><img src="imagens/016.jpg" height="118" width="268"></p>





<p>Se voc&ecirc; escolher um r&oacute;tulo diferente do
antigo e clicar em OK, o r&oacute;tulo antigo volta para a lista de
conceitos e o nosso conceito receber&aacute; o novo
r&oacute;tulo. </p>





<p>J&aacute; ao clicar duas vezes em cima de um exemplo ou de
uma legenda, aparecer&aacute; uma caixa de di&aacute;logo com
uma &aacute;rea de texto como a abaixo.</p>





<p align="center"><img src="imagens/011.jpg" height="190" width="268"></p>





<p>Voc&ecirc; pode, ent&atilde;o, digitar o novo
r&oacute;tulo e clicar em OK.</p>





<p align="left">Para criar relacionamentos, voc&ecirc;
deve posicionar o cursor do mouse sobre um conceito.
Surgir&atilde;o duas setas flutuantes. </p>





<p align="center"><img src="imagens/005.gif" height="31" width="83"></p>





<p>Cada uma corresponde a um tipo de processo cognitivo. O
&iacute;cone indica diferencia&ccedil;&atilde;o progressiva
e o &iacute;cone, reconcilia&ccedil;&atilde;o integrativa.
Saiba mais clicando aqui. </p>





<p>Posicione o mouse sobre uma das setas. Clique e segure o
bot&atilde;o do mouse. Arrastando a seta, voc&ecirc;
ver&aacute; uma linha surgir, para que lhe ajude a desenhar. </p>





<p align="center"><img src="imagens/006.gif" height="121" width="121"></p>





<p>Solte o bot&atilde;o no lugar desejado. Surgir&aacute;
o di&aacute;logo de cria&ccedil;&atilde;o de elementos, o
mesmo descrito anteriormente. Nele, se voc&ecirc; clicar em
Cancelar, nenhum novo elemento ser&aacute; criado. Se
voc&ecirc; clicar em OK, ser&aacute; criada uma
proposi&ccedil;&atilde;o, composta de mais um conceito/exemplo,
uma frase de liga&ccedil;&atilde;o e arcos ligando os
elementos, como voc&ecirc; pode ver na figura abaixo. </p>





<p align="center"><img src="imagens/007.gif" height="239" width="90"></p>





<p>Se voc&ecirc; posicionar o cursor do mouse sobre uma frase
de liga&ccedil;&atilde;o, tamb&eacute;m
aparecer&aacute; uma seta flutuante. Por&eacute;m, apenas uma.
Ela &eacute; do mesmo tipo dos arcos ligados a essa frase. </p>





<p align="center"><img src="imagens/009.gif" height="88" width="116"><img src="imagens/010.gif" height="112" width="100"></p>





<p>A partir de agora, voc&ecirc; pode ir criando seus mapas,
com duplos cliques e arraste de setas flutuantes, vindas de conceitos e
de frases de liga&ccedil;&atilde;o. Uma boa dica &eacute;
criar v&aacute;rios conceitos e, depois, fazer as
proposi&ccedil;&otilde;es.</p>
<p>&nbsp;</p>





<p>&nbsp;</p>





<p>&nbsp;</p>





<h3><a name="3"></a>Editando frases de liga&ccedil;&atilde;o (enlace) </h3>





<p>Para editar o r&oacute;tulo de uma frase de
liga&ccedil;&atilde;o, clique duas vezes com o mouse em cima
dela. Surgir&aacute; uma caixa de di&aacute;logo com uma
&aacute;rvore. Essa &aacute;rvore cont&eacute;m a taxonomia
de frases de liga&ccedil;&atilde;o, de acordo com o explicado
no in&iacute;cio dessa se&ccedil;&atilde;o. </p>





<p align="center"><img src="imagens/017.jpg" height="378" width="360"></p>





<p>Acima, voc&ecirc; v&ecirc; que o di&aacute;logo
cont&eacute;m 3 &aacute;reas: </p>





<ul>





  <li>
    
    
    
    
    <p><strong>&Aacute;rvore taxon&ocirc;mica </strong>,
onde voc&ecirc; seleciona um ramo. Cada ramo cont&eacute;m
frases de liga&ccedil;&atilde;o. </p>





  </li>





  <li>
    
    
    
    
    <p><strong>Frases de liga&ccedil;&atilde;o</strong>,
onde voc&ecirc; seleciona uma das frases. </p>





  </li>





  <li>
    
    
    
    
    <p><strong>Descri&ccedil;&atilde;o do
n&oacute; da &aacute;rvore taxon&ocirc;mica</strong>.
A descri&ccedil;&atilde;o muda de acordo com o n&oacute;
selecionado. </p>





  </li>





</ul>





<p>Busque na &aacute;rvore, selecione uma frase e OK. </p>





</body>
</html>
